//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//
//  File History
//
//  Rev. 1.01
//    Bug Fix : N/A.
//    Reason  : Based on Purley_Setup_Mapping_Language_Draft_20170301_Joe.xlsx 
//              and Official_BIOS_SOP_Revised_Draft_20170301_Mapping_Language_Joe.xlsx 
//              to implement HII mapping language for BIOS setting preservation.
//    Auditor : Joe Jhang
//    Date    : Mar/02/2017
//
//  Rev. 1.00
//    Bug Fix:  Fixed Power Button 4 sec shutdown
//    Reason:   
//    Auditor:  Sunny Yang
//    Date:     Jun/15/2016
//
//**************************************************************************//
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	CmosManager.UNI
//
// Description:	This file contains CMOS form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string STR_SMC_BOOT_FEATURE_FORM         #language eng "Boot Feature"
#string STR_SMC_BOOT_FEATURE_FORM_HELP    #language eng "System Boot Feature Setting."

#string STR_TRUE    #language eng "TRUE"
#string STR_FALSE   #language eng "FALSE"

#string STR_EMPTY   #language eng ""

#string STR_LAST_STATE_POLICY_PROMPT            #language eng "AC Loss Policy Depend on"
#string STR_LAST_STATE_POLICY_HELP              #language eng "Select BIOS or IPMI to decide AC loss policy."
#string STR_LAST_STATE_BIOS                     #language eng "BIOS"
#string STR_LAST_STATE_IPMI                     #language eng "IPMI"
#string STR_LAST_STATE_PROMPT                   #language eng "Restore on AC Power Loss"
                                                #language x-AMI "SMCBL000"
#string STR_LAST_STATE_HELP                     #language eng "Stay Off: System always remains off.\nPower On: System always turns on.\nLast State: System returns to previous state before AC lost."
#string STR_POWER_ON                            #language eng "Power On"
#string STR_POWER_OFF                           #language eng "Stay Off"
#string STR_LAST_STATE                          #language eng "Last State"


#string STR_SMC_POWER_BTN                 #language eng "Power Button Function"
                                          #language x-AMI "COMMN007"
#string STR_SMC_POWER_BTN_HELP            #language eng "Instant Off: Turn off system immediately in legacy OS.\n4 Seconds Override: Turn off system after depressed for 4 seconds."
#string STR_PWR_BTN_INSTANT_OFF           #language eng "Instant Off"
#string STR_PWR_BTN_OVERRIDE              #language eng "4 Seconds Override"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************